infrastructure/results/deprecated/steady-load-output-20260117_004629.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: steady-load.js
        output: json (../results/steady-load-results-20260117_004629.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  0m01.0s/3m00.0s

running (0m02.0s), 04/50 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 04/50 VUs  0m02.0s/3m00.0s

running (0m03.0s), 05/50 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  0m03.0s/3m00.0s

running (0m04.0s), 07/50 VUs, 11 complete and 0 interrupted iterations
default   [   2% ] 07/50 VUs  0m04.0s/3m00.0s

running (0m05.0s), 09/50 VUs, 18 complete and 0 interrupted iterations
default   [   3% ] 09/50 VUs  0m05.0s/3m00.0s

running (0m06.0s), 10/50 VUs, 27 complete and 0 interrupted iterations
default   [   3% ] 10/50 VUs  0m06.0s/3m00.0s

running (0m07.0s), 12/50 VUs, 37 complete and 0 interrupted iterations
default   [   4% ] 12/50 VUs  0m07.0s/3m00.0s

running (0m08.0s), 14/50 VUs, 49 complete and 0 interrupted iterations
default   [   4% ] 14/50 VUs  0m08.0s/3m00.0s

running (0m09.0s), 15/50 VUs, 63 complete and 0 interrupted iterations
default   [   5% ] 15/50 VUs  0m09.0s/3m00.0s

running (0m10.0s), 17/50 VUs, 78 complete and 0 interrupted iterations
default   [   6% ] 17/50 VUs  0m10.0s/3m00.0s

running (0m11.0s), 18/50 VUs, 95 complete and 0 interrupted iterations
default   [   6% ] 18/50 VUs  0m11.0s/3m00.0s

running (0m12.0s), 20/50 VUs, 113 complete and 0 interrupted iterations
default   [   7% ] 20/50 VUs  0m12.0s/3m00.0s

running (0m13.0s), 22/50 VUs, 133 complete and 0 interrupted iterations
default   [   7% ] 22/50 VUs  0m13.0s/3m00.0s

running (0m14.0s), 23/50 VUs, 155 complete and 0 interrupted iterations
default   [   8% ] 23/50 VUs  0m14.0s/3m00.0s

running (0m15.0s), 25/50 VUs, 178 complete and 0 interrupted iterations
default   [   8% ] 25/50 VUs  0m15.0s/3m00.0s

running (0m16.0s), 27/50 VUs, 203 complete and 0 interrupted iterations
default   [   9% ] 27/50 VUs  0m16.0s/3m00.0s

running (0m17.0s), 28/50 VUs, 230 complete and 0 interrupted iterations
default   [   9% ] 28/50 VUs  0m17.0s/3m00.0s

running (0m18.0s), 30/50 VUs, 258 complete and 0 interrupted iterations
default   [  10% ] 30/50 VUs  0m18.0s/3m00.0s

running (0m19.0s), 32/50 VUs, 287 complete and 0 interrupted iterations
default   [  11% ] 32/50 VUs  0m19.0s/3m00.0s

running (0m20.0s), 33/50 VUs, 319 complete and 0 interrupted iterations
default   [  11% ] 33/50 VUs  0m20.0s/3m00.0s

running (0m21.0s), 35/50 VUs, 352 complete and 0 interrupted iterations
default   [  12% ] 35/50 VUs  0m21.0s/3m00.0s

running (0m22.0s), 36/50 VUs, 387 complete and 0 interrupted iterations
default   [  12% ] 36/50 VUs  0m22.0s/3m00.0s

running (0m23.0s), 38/50 VUs, 423 complete and 0 interrupted iterations
default   [  13% ] 38/50 VUs  0m23.0s/3m00.0s

running (0m24.0s), 40/50 VUs, 460 complete and 0 interrupted iterations
default   [  13% ] 40/50 VUs  0m24.0s/3m00.0s

running (0m25.0s), 41/50 VUs, 500 complete and 0 interrupted iterations
default   [  14% ] 41/50 VUs  0m25.0s/3m00.0s

running (0m26.0s), 43/50 VUs, 541 complete and 0 interrupted iterations
default   [  14% ] 43/50 VUs  0m26.0s/3m00.0s

running (0m27.0s), 45/50 VUs, 584 complete and 0 interrupted iterations
default   [  15% ] 45/50 VUs  0m27.0s/3m00.0s

running (0m28.0s), 46/50 VUs, 625 complete and 0 interrupted iterations
default   [  16% ] 46/50 VUs  0m28.0s/3m00.0s

running (0m29.0s), 48/50 VUs, 661 complete and 0 interrupted iterations
default   [  16% ] 48/50 VUs  0m29.0s/3m00.0s

running (0m30.0s), 49/50 VUs, 709 complete and 0 interrupted iterations
default   [  17% ] 49/50 VUs  0m30.0s/3m00.0s

running (0m31.0s), 50/50 VUs, 757 complete and 0 interrupted iterations
default   [  17% ] 50/50 VUs  0m31.0s/3m00.0s

running (0m32.0s), 50/50 VUs, 807 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m32.0s/3m00.0s

running (0m33.0s), 50/50 VUs, 857 complete and 0 interrupted iterations
default   [  18% ] 50/50 VUs  0m33.0s/3m00.0s

running (0m34.0s), 50/50 VUs, 907 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m34.0s/3m00.0s

running (0m35.0s), 50/50 VUs, 957 complete and 0 interrupted iterations
default   [  19% ] 50/50 VUs  0m35.0s/3m00.0s

running (0m36.0s), 50/50 VUs, 1002 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  0m36.0s/3m00.0s

running (0m37.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  0m37.0s/3m00.0s

running (0m38.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  0m38.0s/3m00.0s

running (0m39.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  0m39.0s/3m00.0s

running (0m40.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  0m40.0s/3m00.0s

running (0m41.0s), 50/50 VUs, 1247 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  0m41.0s/3m00.0s

running (0m42.0s), 50/50 VUs, 1297 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  0m42.0s/3m00.0s

running (0m43.0s), 50/50 VUs, 1347 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  0m43.0s/3m00.0s

running (0m44.0s), 50/50 VUs, 1397 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  0m44.0s/3m00.0s

running (0m45.0s), 50/50 VUs, 1447 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  0m45.0s/3m00.0s

running (0m46.0s), 50/50 VUs, 1497 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  0m46.0s/3m00.0s

running (0m47.0s), 50/50 VUs, 1547 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  0m47.0s/3m00.0s

running (0m48.0s), 50/50 VUs, 1597 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  0m48.0s/3m00.0s

running (0m49.0s), 50/50 VUs, 1647 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  0m49.0s/3m00.0s

running (0m50.0s), 50/50 VUs, 1697 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  0m50.0s/3m00.0s

running (0m51.0s), 50/50 VUs, 1747 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  0m51.0s/3m00.0s

running (0m52.0s), 50/50 VUs, 1797 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  0m52.0s/3m00.0s

running (0m53.0s), 50/50 VUs, 1847 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  0m53.0s/3m00.0s

running (0m54.0s), 50/50 VUs, 1897 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  0m54.0s/3m00.0s

running (0m55.0s), 50/50 VUs, 1947 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m55.0s/3m00.0s

running (0m56.0s), 50/50 VUs, 1997 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m56.0s/3m00.0s

running (0m57.0s), 50/50 VUs, 2047 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  0m57.0s/3m00.0s

running (0m58.0s), 50/50 VUs, 2097 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  0m58.0s/3m00.0s

running (0m59.0s), 50/50 VUs, 2147 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  0m59.0s/3m00.0s

running (1m00.0s), 50/50 VUs, 2197 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m00.0s/3m00.0s

running (1m01.0s), 50/50 VUs, 2247 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m01.0s/3m00.0s

running (1m02.0s), 50/50 VUs, 2297 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m02.0s/3m00.0s

running (1m03.0s), 50/50 VUs, 2344 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m03.0s/3m00.0s

running (1m04.0s), 50/50 VUs, 2394 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m04.0s/3m00.0s

running (1m05.0s), 50/50 VUs, 2444 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m05.0s/3m00.0s

running (1m06.0s), 50/50 VUs, 2494 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m06.0s/3m00.0s

running (1m07.0s), 50/50 VUs, 2544 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m07.0s/3m00.0s

running (1m08.0s), 50/50 VUs, 2594 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m08.0s/3m00.0s

running (1m09.0s), 50/50 VUs, 2644 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m09.0s/3m00.0s

running (1m10.0s), 50/50 VUs, 2694 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m10.0s/3m00.0s

running (1m11.0s), 50/50 VUs, 2743 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m11.0s/3m00.0s

running (1m12.0s), 50/50 VUs, 2793 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m12.0s/3m00.0s

running (1m13.0s), 50/50 VUs, 2843 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  1m13.0s/3m00.0s

running (1m14.0s), 50/50 VUs, 2893 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  1m14.0s/3m00.0s

running (1m15.0s), 50/50 VUs, 2943 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  1m15.0s/3m00.0s

running (1m16.0s), 50/50 VUs, 2993 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  1m16.0s/3m00.0s

running (1m17.0s), 50/50 VUs, 3043 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  1m17.0s/3m00.0s

running (1m18.0s), 50/50 VUs, 3093 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  1m18.0s/3m00.0s

running (1m19.0s), 50/50 VUs, 3143 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  1m19.0s/3m00.0s

running (1m20.0s), 50/50 VUs, 3193 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  1m20.0s/3m00.0s

running (1m21.0s), 50/50 VUs, 3243 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  1m21.0s/3m00.0s

running (1m22.0s), 50/50 VUs, 3293 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  1m22.0s/3m00.0s

running (1m23.0s), 50/50 VUs, 3343 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  1m23.0s/3m00.0s

running (1m24.0s), 50/50 VUs, 3393 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  1m24.0s/3m00.0s

running (1m25.0s), 50/50 VUs, 3443 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  1m25.0s/3m00.0s

running (1m26.0s), 50/50 VUs, 3493 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  1m26.0s/3m00.0s

running (1m27.0s), 50/50 VUs, 3537 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  1m27.0s/3m00.0s

running (1m28.0s), 50/50 VUs, 3587 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  1m28.0s/3m00.0s

running (1m29.0s), 50/50 VUs, 3637 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  1m29.0s/3m00.0s

running (1m30.0s), 50/50 VUs, 3687 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  1m30.0s/3m00.0s

running (1m31.0s), 50/50 VUs, 3737 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m31.0s/3m00.0s

running (1m32.0s), 50/50 VUs, 3787 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m32.0s/3m00.0s

running (1m33.0s), 50/50 VUs, 3837 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m33.0s/3m00.0s

running (1m34.0s), 50/50 VUs, 3887 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m34.0s/3m00.0s

running (1m35.0s), 50/50 VUs, 3937 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m35.0s/3m00.0s

running (1m36.0s), 50/50 VUs, 3987 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m36.0s/3m00.0s

running (1m37.0s), 50/50 VUs, 4037 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m37.0s/3m00.0s

running (1m38.0s), 50/50 VUs, 4087 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m38.0s/3m00.0s

running (1m39.0s), 50/50 VUs, 4137 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  1m39.0s/3m00.0s

running (1m40.0s), 50/50 VUs, 4187 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m40.0s/3m00.0s

running (1m41.0s), 50/50 VUs, 4237 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m41.0s/3m00.0s

running (1m42.0s), 50/50 VUs, 4287 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m42.0s/3m00.0s

running (1m43.0s), 50/50 VUs, 4337 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m43.0s/3m00.0s

running (1m44.0s), 50/50 VUs, 4387 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  1m44.0s/3m00.0s

running (1m45.0s), 50/50 VUs, 4437 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  1m45.0s/3m00.0s

running (1m46.0s), 50/50 VUs, 4487 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  1m46.0s/3m00.0s

running (1m47.0s), 50/50 VUs, 4537 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  1m47.0s/3m00.0s

running (1m48.0s), 50/50 VUs, 4584 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  1m48.0s/3m00.0s

running (1m49.0s), 50/50 VUs, 4634 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m49.0s/3m00.0s

running (1m50.0s), 50/50 VUs, 4684 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m50.0s/3m00.0s

running (1m51.0s), 50/50 VUs, 4733 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  1m51.0s/3m00.0s

running (1m52.0s), 50/50 VUs, 4783 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  1m52.0s/3m00.0s

running (1m53.0s), 50/50 VUs, 4833 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m53.0s/3m00.0s

running (1m54.0s), 50/50 VUs, 4883 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m54.0s/3m00.0s

running (1m55.0s), 50/50 VUs, 4933 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  1m55.0s/3m00.0s

running (1m56.0s), 50/50 VUs, 4983 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  1m56.0s/3m00.0s

running (1m57.0s), 50/50 VUs, 5033 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  1m57.0s/3m00.0s

running (1m58.0s), 50/50 VUs, 5083 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  1m58.0s/3m00.0s

running (1m59.0s), 50/50 VUs, 5133 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  1m59.0s/3m00.0s

running (2m00.0s), 50/50 VUs, 5183 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  2m00.0s/3m00.0s

running (2m01.0s), 50/50 VUs, 5225 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  2m01.0s/3m00.0s

running (2m02.0s), 50/50 VUs, 5275 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  2m02.0s/3m00.0s

running (2m03.0s), 50/50 VUs, 5325 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  2m03.0s/3m00.0s

running (2m04.0s), 50/50 VUs, 5375 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  2m04.0s/3m00.0s

running (2m05.0s), 50/50 VUs, 5425 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  2m05.0s/3m00.0s

running (2m06.0s), 50/50 VUs, 5475 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  2m06.0s/3m00.0s

running (2m07.0s), 50/50 VUs, 5525 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  2m07.0s/3m00.0s

running (2m08.0s), 50/50 VUs, 5575 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  2m08.0s/3m00.0s

running (2m09.0s), 50/50 VUs, 5625 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  2m09.0s/3m00.0s

running (2m10.0s), 50/50 VUs, 5675 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  2m10.0s/3m00.0s

running (2m11.0s), 50/50 VUs, 5725 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  2m11.0s/3m00.0s

running (2m12.0s), 50/50 VUs, 5775 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  2m12.0s/3m00.0s

running (2m13.0s), 50/50 VUs, 5825 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  2m13.0s/3m00.0s

running (2m14.0s), 50/50 VUs, 5875 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  2m14.0s/3m00.0s

running (2m15.0s), 50/50 VUs, 5925 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  2m15.0s/3m00.0s

running (2m16.0s), 50/50 VUs, 5975 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  2m16.0s/3m00.0s

running (2m17.0s), 50/50 VUs, 6025 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  2m17.0s/3m00.0s

running (2m18.0s), 50/50 VUs, 6075 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  2m18.0s/3m00.0s

running (2m19.0s), 50/50 VUs, 6125 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  2m19.0s/3m00.0s

running (2m20.0s), 50/50 VUs, 6175 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  2m20.0s/3m00.0s

running (2m21.0s), 50/50 VUs, 6225 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  2m21.0s/3m00.0s

running (2m22.0s), 50/50 VUs, 6275 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  2m22.0s/3m00.0s

running (2m23.0s), 50/50 VUs, 6325 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  2m23.0s/3m00.0s

running (2m24.0s), 50/50 VUs, 6371 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  2m24.0s/3m00.0s

running (2m25.0s), 50/50 VUs, 6421 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m25.0s/3m00.0s

running (2m26.0s), 50/50 VUs, 6471 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m26.0s/3m00.0s

running (2m27.0s), 50/50 VUs, 6521 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  2m27.0s/3m00.0s

running (2m28.0s), 50/50 VUs, 6571 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  2m28.0s/3m00.0s

running (2m29.0s), 50/50 VUs, 6621 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  2m29.0s/3m00.0s

running (2m30.0s), 50/50 VUs, 6671 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  2m30.0s/3m00.0s

running (2m31.0s), 49/50 VUs, 6720 complete and 0 interrupted iterations
default   [  84% ] 49/50 VUs  2m31.0s/3m00.0s

running (2m32.0s), 49/50 VUs, 6764 complete and 0 interrupted iterations
default   [  84% ] 49/50 VUs  2m32.0s/3m00.0s

running (2m33.0s), 47/50 VUs, 6813 complete and 0 interrupted iterations
default   [  85% ] 47/50 VUs  2m33.0s/3m00.0s

running (2m34.0s), 44/50 VUs, 6860 complete and 0 interrupted iterations
default   [  86% ] 44/50 VUs  2m34.0s/3m00.0s

running (2m35.0s), 43/50 VUs, 6904 complete and 0 interrupted iterations
default   [  86% ] 43/50 VUs  2m35.0s/3m00.0s

running (2m36.0s), 41/50 VUs, 6947 complete and 0 interrupted iterations
default   [  87% ] 41/50 VUs  2m36.0s/3m00.0s

running (2m37.0s), 40/50 VUs, 6988 complete and 0 interrupted iterations
default   [  87% ] 40/50 VUs  2m37.0s/3m00.0s

running (2m38.0s), 39/50 VUs, 7028 complete and 0 interrupted iterations
default   [  88% ] 39/50 VUs  2m38.0s/3m00.0s

running (2m39.0s), 36/50 VUs, 7067 complete and 0 interrupted iterations
default   [  88% ] 36/50 VUs  2m39.0s/3m00.0s

running (2m40.0s), 34/50 VUs, 7103 complete and 0 interrupted iterations
default   [  89% ] 34/50 VUs  2m40.0s/3m00.0s

running (2m41.0s), 33/50 VUs, 7137 complete and 0 interrupted iterations
default   [  89% ] 33/50 VUs  2m41.0s/3m00.0s

running (2m42.0s), 31/50 VUs, 7170 complete and 0 interrupted iterations
default   [  90% ] 31/50 VUs  2m42.0s/3m00.0s

running (2m43.0s), 30/50 VUs, 7201 complete and 0 interrupted iterations
default   [  91% ] 30/50 VUs  2m43.0s/3m00.0s

running (2m44.0s), 28/50 VUs, 7231 complete and 0 interrupted iterations
default   [  91% ] 28/50 VUs  2m44.0s/3m00.0s

running (2m45.0s), 27/50 VUs, 7259 complete and 0 interrupted iterations
default   [  92% ] 27/50 VUs  2m45.0s/3m00.0s

running (2m46.0s), 25/50 VUs, 7286 complete and 0 interrupted iterations
default   [  92% ] 25/50 VUs  2m46.0s/3m00.0s

running (2m47.0s), 23/50 VUs, 7311 complete and 0 interrupted iterations
default   [  93% ] 23/50 VUs  2m47.0s/3m00.0s

running (2m48.0s), 22/50 VUs, 7334 complete and 0 interrupted iterations
default   [  93% ] 22/50 VUs  2m48.0s/3m00.0s

running (2m49.0s), 19/50 VUs, 7356 complete and 0 interrupted iterations
default   [  94% ] 19/50 VUs  2m49.0s/3m00.0s

running (2m50.0s), 18/50 VUs, 7375 complete and 0 interrupted iterations
default   [  94% ] 18/50 VUs  2m50.0s/3m00.0s

running (2m51.0s), 17/50 VUs, 7393 complete and 0 interrupted iterations
default   [  95% ] 17/50 VUs  2m51.0s/3m00.0s

running (2m52.0s), 15/50 VUs, 7410 complete and 0 interrupted iterations
default   [  96% ] 15/50 VUs  2m52.0s/3m00.0s

running (2m53.0s), 13/50 VUs, 7425 complete and 0 interrupted iterations
default   [  96% ] 13/50 VUs  2m53.0s/3m00.0s

running (2m54.0s), 11/50 VUs, 7438 complete and 0 interrupted iterations
default   [  97% ] 11/50 VUs  2m54.0s/3m00.0s

running (2m55.0s), 10/50 VUs, 7449 complete and 0 interrupted iterations
default   [  97% ] 10/50 VUs  2m55.0s/3m00.0s

running (2m56.0s), 08/50 VUs, 7459 complete and 0 interrupted iterations
default   [  98% ] 08/50 VUs  2m56.0s/3m00.0s

running (2m57.0s), 06/50 VUs, 7467 complete and 0 interrupted iterations
default   [  98% ] 06/50 VUs  2m57.0s/3m00.0s

running (2m58.0s), 05/50 VUs, 7473 complete and 0 interrupted iterations
default   [  99% ] 05/50 VUs  2m58.0s/3m00.0s

running (2m59.0s), 03/50 VUs, 7478 complete and 0 interrupted iterations
default   [  99% ] 03/50 VUs  2m59.0s/3m00.0s

running (3m00.0s), 02/50 VUs, 7481 complete and 0 interrupted iterations
default   [ 100% ] 02/50 VUs  3m00.0s/3m00.0s
time="2026-01-17T00:49:45+07:00" level=info msg="\n📊 Steady Load Test Results:" source=console
time="2026-01-17T00:49:45+07:00" level=info msg="============================" source=console
time="2026-01-17T00:49:45+07:00" level=info msg="✅ Test completed successfully" source=console
time="2026-01-17T00:49:45+07:00" level=info msg="📈 Check metrics above for performance analysis" source=console
time="2026-01-17T00:49:45+07:00" level=info msg="🔍 Traffic distribution analysis available in HAProxy stats" source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<150' p(95)=8.56ms

      {scenario:default}
      ✓ 'p(99)<300' p(99)=52.64ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%

    http_reqs
    ✗ 'rate>=45' rate=41.445906/s


  █ TOTAL RESULTS 

    checks_total.......................: 22449  124.337718/s
    checks_succeeded...................: 99.72% 22387 out of 22449
    checks_failed......................: 0.27%  62 out of 22449

    ✓ status is 200
    ✗ response time < 150ms
      ↳  99% — ✓ 7446 / ✗ 37
    ✗ response time < 300ms
      ↳  99% — ✓ 7458 / ✗ 25

    CUSTOM
    errors..................................................................: 0.00%  0 out of 7483
    response_time...........................................................: avg=6.727649 min=0.294 med=2.547  max=1657.177 p(90)=6.3026 p(95)=8.5698

    HTTP
    http_req_duration.......................................................: avg=6.72ms   min=294µs med=2.54ms max=1.65s    p(90)=6.3ms  p(95)=8.56ms
      { expected_response:true }............................................: avg=6.72ms   min=294µs med=2.54ms max=1.65s    p(90)=6.3ms  p(95)=8.56ms
      { scenario:default }..................................................: avg=6.72ms   min=294µs med=2.54ms max=1.65s    p(90)=6.3ms  p(95)=8.56ms
    http_req_failed.........................................................: 0.00%  0 out of 7483
    http_reqs...............................................................: 7483   41.445906/s

    EXECUTION
    iteration_duration......................................................: avg=1s       min=1s    med=1s     max=2.66s    p(90)=1s     p(95)=1.01s 
    iterations..............................................................: 7483   41.445906/s
    vus.....................................................................: 2      min=2         max=50
    vus_max.................................................................: 50     min=50        max=50

    NETWORK
    data_received...........................................................: 1.0 MB 5.8 kB/s
    data_sent...............................................................: 576 kB 3.2 kB/s



running (3m00.5s), 00/50 VUs, 7483 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  3m0s
time="2026-01-17T00:49:46+07:00" level=error msg="thresholds on metrics 'http_reqs' have been crossed"